/*******************************************************************************

        copyright:      Copyright (c) 2004 Kris Bell. все rights reserved

        license:        BSD стиль: $(LICENSE)
      
        version:        Initial release: May 2004
        
        author:         Kris

*******************************************************************************/

module util.log.AppendFile;

private import  util.log.Log;
private import  io.device.File;
private import  io.stream.Buffered;
private import  io.model;

/*******************************************************************************

        Добавляет сообщения лога в файл. У базовой версии отсутствует поддержка
		rollover, поэтому просто идёт постоянная добавь в файл. ДобВФайлы может
		удовлетворить ваши замыслы.

*******************************************************************************/

class ДобВФайл : Файлер
{
        private Маска    маска_;

        /***********************************************************************
                
            Создаёт базовый FileAppender в файл, расположенный по заданному пути.

        ***********************************************************************/

        this (ткст fp, Добавщик.Выкладка как = пусто);

        /***********************************************************************
                
                Вернуть fingerprint для данного класса

        ***********************************************************************/

        final Маска маска ();

        /***********************************************************************
                
                Вернуть имя данного класса

        ***********************************************************************/

        final ткст имя ();
                
        /***********************************************************************
                
                Добавить на вывод событие.
                 
        ***********************************************************************/

        final synchronized проц добавь (СобытиеЛога событие);
}


/*******************************************************************************

        Класс-основа для добавщиков в файл.

*******************************************************************************/

class Файлер : Добавщик
{
        package Бвыв            буфер;
        private ИПровод        провод_;

        /***********************************************************************
                
                Вернуть провод.

        ***********************************************************************/

        final ИПровод провод ();

        /***********************************************************************
                
                Закрыть файл, ассоциированный с этим Добавщиком.

        ***********************************************************************/

        final synchronized проц закрой ();

        /***********************************************************************
                
                Установить провод.

        ***********************************************************************/

        package final Бвыв конфигурируй (ИПровод провод);
}


