/**
 * Author:          Lester L. Martin II
 *                  UWB, bobef
 * Copyright:       (c) Lester L. Martin II
 *                  UWB, bobef
 * Based upon приор FtpClient.d 
 * License:         BSD стиль: $(LICENSE)
 * Initial release:  August 8, 2008  
 */

module net.ftp.FtpClient;

private 
{
    import net.ftp.Telnet;
    import text.Util;
    import time.Clock;
    import text.Regex: Regex;
    import time.chrono.Gregorian;
    import core.Array;
    import net.device.Socket;
    import io.device.Conduit;
    import io.device.Array;
    import io.device.File;

    import Текст = text.Util;
    import Ascii = text.Ascii;
    import Целое = text.convert.Integer;
    import Timestamp = text.convert.TimeStamp;
}

/******************************************************************************
 An FTP ход delegate.
 
 You may need в_ добавь the restart позиция в_ this, и use SIZE в_ determine
 percentage completion.  This only represents the число of байты
 transferred.
 
 Параметры:
 поз =                 the текущ смещение преобр_в the поток
 ******************************************************************************/
alias проц delegate(in т_мера поз) ХодФтп;

/******************************************************************************
 The форматируй of данные перемести.
 ******************************************************************************/
enum ПФорматФтп 
{
    /**********************************************************************
     Indicates ASCII NON PRINT форматируй (строка ending conversion в_ CRLF.)
     **********************************************************************/
    аски,
    /**********************************************************************
     Indicates IMAGE форматируй (8 bit binary octets.)
     **********************************************************************/
    образ,
}

/******************************************************************************
 A АдресФтп structure that содержит все 
 that is needed в_ доступ a СоединениеФтп; Contributed by Bobef
 
 Since: 0.99.8
 ******************************************************************************/
struct АдресФтп 
{
    static АдресФтп* opCall(ткст стр);

    ткст адрес;
    ткст дир;
    ткст пользователь = "anonymous";
    ткст пароль = "anonymous@anonymous";
    бцел порт = 21;
}

/******************************************************************************
 A сервер ответ, consisting of a код и a potentially multi-строка 
 сообщение.
 ******************************************************************************/
struct ОтветФтп 
{
    /**********************************************************************
     The ответ код.
     
     The цифры in the ответ код can be использован в_ determine статус
     programatically.
     
     First Digit (статус):
     1xx =             a positive, but preliminary, reply
     2xx =             a positive reply indicating completion
     3xx =             a positive reply indicating incomplete статус
     4xx =             a temporary негатив reply
     5xx =             a permanent негатив reply
     
     сукунда Digit (субъект):
     x0x =             condition based on syntax
     x1x =             informational
     x2x =             connection
     x3x =             authentication/process
     x5x =             файл system
     **********************************************************************/
    сим[3] код = "000";

    /*********************************************************************
     The сообщение из_ the сервер.
     
     With some responses, the сообщение may contain parseable information.
     For example, this is да of the 257 ответ.
     **********************************************************************/
    ткст сообщение = пусто;
}

/******************************************************************************
 Active or пассивное connection режим.
 ******************************************************************************/
enum ПТипСоединенияФтп 
{
    /**********************************************************************
     Active - сервер connects в_ клиент on открой порт.
     **********************************************************************/
    активное,
    /**********************************************************************
     Passive - сервер listens for a connection из_ the клиент.
     **********************************************************************/
    пассивное,
}

/******************************************************************************
 Detail about the данные connection.
 
 This is использован в_ properly шли PORT и PASV commands.
 ******************************************************************************/
struct ДеталиПодключенияФтп 
{
    /**********************************************************************
     The тип в_ be использован.
     **********************************************************************/
    ПТипСоединенияФтп тип = ПТипСоединенияФтп.пассивное;

    /**********************************************************************
     The адрес в_ give the сервер.
     **********************************************************************/
    Адрес адрес = пусто;

    /**********************************************************************
     The адрес в_ actually слушай on.
     **********************************************************************/
    Адрес слушай = пусто;
}

/******************************************************************************
 A supported feature of an FTP сервер.
 ******************************************************************************/
struct ЭлтФтп 
{
    /**********************************************************************
     The команда which is supported, e.g. SIZE.
     **********************************************************************/
    ткст команда = пусто;
    /**********************************************************************
     Параметры for this команда; e.g. факты for MLST.
     **********************************************************************/
    ткст парамы = пусто;
}

/******************************************************************************
 The тип of a файл in an FTP listing.
 ******************************************************************************/
enum ПТипФайлаФтп 
{
    /**********************************************************************
     An неизвестное файл or тип (no тип fact.)
     **********************************************************************/
    неизвестное,
    /**********************************************************************
     A regular файл, or similar.
     **********************************************************************/
    файл,
    /**********************************************************************
     The текущ дир (e.g. ., but not necessarily.)
     **********************************************************************/
    тдир,
    /**********************************************************************
     A предок дир (usually "..".)
     **********************************************************************/
    пдир,
    /**********************************************************************
     Any другой тип of дир.
     **********************************************************************/
    пап,
    /**********************************************************************
     другой тип of файл.  Consult the "тип" fact.
     **********************************************************************/
    другой,
}

/******************************************************************************
 Information about a файл in an FTP listing.
 ******************************************************************************/
struct ИнфОФайлеФтп 
{
    /**********************************************************************
     The имяф.
     **********************************************************************/
    ткст имя = пусто;
    /**********************************************************************
     Its тип.
     **********************************************************************/
    ПТипФайлаФтп тип = ПТипФайлаФтп.неизвестное;
    /**********************************************************************
     Размер in байты (8 bit octets), or бдол.max if not available.
     Since: 0.99.8
     **********************************************************************/
    бдол размер = бдол.max;
    /**********************************************************************
     Modification время, if available.
     **********************************************************************/
    Время изменён = Время.макс;
    /**********************************************************************
     Creation время, if available (not often.)
     **********************************************************************/
    Время создан = Время.макс;
    /**********************************************************************
     The файл's mime тип, if known.
     **********************************************************************/
    ткст майм = пусто;
    /***********************************************************************
     An associative Массив of все факты returned by the сервер, lowercased.
     ***********************************************************************/
    ткст[ткст] факты;
}

/*******************************************************************************
 Changed location Since: 0.99.8
 Documentation Pending
 *******************************************************************************/
class ИсклФтп: Исключение 
{
    сим[3] responseCode_ = "000";

    /***********************************************************************
     Construct an ИсклФтп based on a сообщение и код.
     
     Параметры:
     сообщение =         the исключение сообщение
     код =            the код (5xx for фатал ошибки)
     ***********************************************************************/
    this(ткст сообщение, сим[3] код = "420") ;

    /***********************************************************************
     Construct an ИсклФтп based on a ответ.
     
     Параметры:
     r =               the сервер ответ
     ***********************************************************************/
    this(ОтветФтп r);

    /***********************************************************************
     A ткст representation of the ошибка.
     ***********************************************************************/
    ткст вТкст();
}

/*******************************************************************************
 Seriously изменён Since: 0.99.8
 Documentation pending
 *******************************************************************************/
class СоединениеФтп: Telnet 
{

    ЭлтФтп[] supportedFeatures_ = пусто;
    ДеталиПодключенияФтп inf_;
    т_мера restartPos_ = 0;
    ткст currFile_ = "";
    Сокет dataСОКЕТ_;
    ИнтервалВремени timeout_ ;//= ИнтервалВремени.изМиллисек(5000);

    /***********************************************************************
     добавьed Since: 0.99.8
     ***********************************************************************/
    public ИнтервалВремени таймаут();

    /***********************************************************************
     добавьed Since: 0.99.8
     ***********************************************************************/
    public проц таймаут(ИнтервалВремени t) ;

    /***********************************************************************
     добавьed Since: 0.99.8
     ***********************************************************************/
    public ИнтервалВремени времяШатдауна() ;

    /***********************************************************************
     добавьed Since: 0.99.8
     ***********************************************************************/
    public ЭлтФтп[] поддерживаемыеВозможности() ;

    /***********************************************************************
     Changed Since: 0.99.8
     ***********************************************************************/
    проц исключение(ткст сообщение) ;

    /***********************************************************************
     Changed Since: 0.99.8
     ***********************************************************************/
    проц исключение(ОтветФтп fr) ;

    public this() ;

    public this(ткст имя_хоста, ткст ник = "anonymous",
            ткст пароль = "anonymous@anonymous", бцел порт = 21) ;

    /***********************************************************************
     добавьed Since: 0.99.8
     ***********************************************************************/
    public this(АдресФтп fad) ;

    /***********************************************************************
     добавьed Since: 0.99.8
     ***********************************************************************/
    public проц подключись(АдресФтп fad) ;

    /************************************************************************
     Changed Since: 0.99.8
     ************************************************************************/
    public проц подключись(ткст имя_хоста, ткст ник = "anonymous",
            ткст пароль = "anonymous@anonymous", бцел порт = 21);

    public проц закрой() ;

    public проц устПассив();

    public проц устАктив(ткст ИП, бкрат порт, ткст ип_прослушки = пусто,
            бкрат порт_прослушки = 0);

    public проц cd(ткст пап);

    public проц cdup() ;

    public ткст текрабпап() ;

    public проц chmod(ткст путь, цел режим);

    public проц del(ткст путь);

    public проц rm(ткст путь);

    public проц переименуй(ткст old_path, ткст new_path);

    /***********************************************************************
     добавьed Since: 0.99.8
     ***********************************************************************/
    цел exist(ткст файл) ;

    public т_мера размер(ткст путь, ПФорматФтп форматируй = ПФорматФтп.образ);

    public проц тип(ПФорматФтп форматируй) ;

    /***********************************************************************
     добавьed Since: 0.99.8
     ***********************************************************************/
    Время изменён(ткст файл);

    protected Время разборВремзнач(ткст значврем);

    public проц noop() ;

    public ткст mkdir(ткст путь);

    public проц дайВозможности() ;

    public проц шлиКоманду(ткст команда, ткст[] параметры...) ;

    public ОтветФтп читайОтвет(ткст ожидаемый_код) ;

    public ОтветФтп читайОтвет();

    protected ткст разбор257(ОтветФтп ответ);

    /*******************************************************************************
     Get a данные сокет из_ the сервер.
     
     This Отправкаs PASV/PORT as necessary.
     
     Возвращает:             the данные сокет or a listener
     Changed Since: 0.99.8
     *******************************************************************************/
    protected Сокет дайСокетДанных() ;

    /*******************************************************************************
     Отправка a PASV и initiate a connection.
     
     Возвращает:             a подключен сокет
     Changed Since: 0.99.8
     *******************************************************************************/
    public Сокет подключисьПассивно() ;

    /*
     Сокет сок = new Сокет();
     сок.подключись(connect_to);
     return сок;
     */

    public бул поддерживается(ткст команда);

    public бул поддерживается_ли(ткст команда) ;

    /*******************************************************************************
     Prepare a данные сокет for use.
     
     This modifies the сокет in some cases.
     
     Параметры:
     данные =            the данные listener сокет
     Changed Since: 0.99.8
     ********************************************************************************/
    protected проц подготовьСокетДанных(ref Сокет данные);

    /*****************************************************************************
     Changed Since: 0.99.8
     *****************************************************************************/
    public проц завершиКомандуДанных(Сокет данные) ;

    /*****************************************************************************
     Changed Since: 0.99.8
     *****************************************************************************/
    public Сокет обработайКомандуДанных(ткст команда, ткст[] параметры...);

    public ИнфОФайлеФтп[] ls(ткст путь = "");

    /*****************************************************************************
     Changed Since: 0.99.8
     *****************************************************************************/
    protected проц читайПоток(Сокет данные, ИПотокВывода поток,
            ХодФтп ход = пусто);

    /*****************************************************************************
     Changed Since: 0.99.8
     *****************************************************************************/
    protected проц шлиВПоток(Сокет данные, ИПотокВвода поток,
            ХодФтп ход = пусто);

    protected ИнфОФайлеФтп[] шлиКомандуСписок(ткст путь);

    protected ИнфОФайлеФтп разборСтрокиСписка(ткст строка) ;

    protected ИнфОФайлеФтп разборСтрокиМлст(ткст строка) ;

    public ИнфОФайлеФтп дайИнфОФайле(ткст путь);

    public проц помести(ткст путь, ткст локальн_файл,
            ХодФтп ход = пусто, ПФорматФтп форматируй = ПФорматФтп.образ);

    /********************************************************************************
     Store данные из_ a поток on the сервер.
     
     Calling this function will change the текущ данные перемести форматируй.
     
     Параметры:
     путь =            the путь в_ the remote файл
     поток =          данные в_ сохрани, or пусто for a blank файл
     ход =        a delegate в_ вызов with ход information
     форматируй =          что форматируй в_ шли the данные in
     ********************************************************************************/
    public проц помести(ткст путь, ИПотокВвода поток = пусто,
            ХодФтп ход = пусто, ПФорматФтп форматируй = ПФорматФтп.образ);

    /********************************************************************************
     Доб данные в_ a файл on the сервер.
     
     Calling this function will change the текущ данные перемести форматируй.
     
     Параметры:
     путь =            the путь в_ the remote файл
     поток =          данные в_ добавь в_ the файл
     ход =        a delegate в_ вызов with ход information
     форматируй =          что форматируй в_ шли the данные in
     ********************************************************************************/
    public проц добавь(ткст путь, ИПотокВвода поток,
            ХодФтп ход = пусто, ПФорматФтп форматируй = ПФорматФтп.образ);

    /*********************************************************************************
     Seek в_ a байт смещение for the следщ перемести.
     
     Параметры:
     смещение =          the число of байты в_ сместись вперёд
     **********************************************************************************/
    public проц рестартСик(т_мера смещение);

    /**********************************************************************************
     Размести пространство for a файл.
     
     After calling this, добавь() or помести() should be the следщ команда.
     
     Параметры:
     байты =           the число of байты в_ размести
     ***********************************************************************************/
    public проц размести(дол байты);

    /**********************************************************************************
     Retrieve a remote файл's contents преобр_в a local файл.
     
     Calling this function will change the текущ данные перемести форматируй.
     
     Параметры:
     путь =            the путь в_ the remote файл
     локальн_файл =      the путь в_ the local файл
     ход =        a delegate в_ вызов with ход information
     форматируй =          что форматируй в_ читай the данные in
     **********************************************************************************/
    public проц получи(ткст путь, ткст локальн_файл,
            ХодФтп ход = пусто, ПФорматФтп форматируй = ПФорматФтп.образ);

    /*********************************************************************************
     Enable UTF8 on servers that don't use this as default. Might need some work
     *********************************************************************************/
    public проц активируйУТФ8() ;

    /**********************************************************************************
     Retrieve a remote файл's contents преобр_в a local файл.
     
     Calling this function will change the текущ данные перемести форматируй.
     
     Параметры:
     путь =            the путь в_ the remote файл
     поток =          поток в_ пиши the данные в_
     ход =        a delegate в_ вызов with ход information
     форматируй =          что форматируй в_ читай the данные in
     ***********************************************************************************/
    public проц получи(ткст путь, ИПотокВывода поток,
            ХодФтп ход = пусто, ПФорматФтп форматируй = ПФорматФтп.образ);

    /*****************************************************************************
     добавьed Since: 0.99.8
     *****************************************************************************/
    public ИПотокВвода ввод(ткст путь) ;

    /*****************************************************************************
     добавьed Since: 0.99.8
     *****************************************************************************/
    public ИПотокВывода вывод(ткст путь) ;
}
