/*******************************************************************************

        copyright:      Copyright (c) 2004 Kris Bell. все rights reserved

        license:        BSD стиль: $(LICENSE)
        
        version:        Initial release: April 2004      
        
        author:         Kris

*******************************************************************************/

module net.http.HttpHeaders;

private import  time.Time;

private import  io.stream.Lines;

private import  io.model, io.stream.Buffered;

public  import  net.http.HttpConst;

private import  net.http.HttpTokens;

/******************************************************************************

        Exposes freachable ЗаголовокППГТ экземпляры 

******************************************************************************/

struct ЭлементЗаголовка
{
        ИмяЗаголовкаППГТ  имя;
        ткст          значение;
}

/******************************************************************************

        Maintains a установи of ввод заголовки. These are placed преобр_в an ввод
        буфер и indexed via a СтэкППГТ. 

******************************************************************************/

class ОбзорЗаголовковППГТ : ТокеныППГТ
{
        // tell compiler в_ использован super.разбор() also
       // alias ТокеныППГТ.разбор разбор;

        private Строки!(сим) строка;
        private бул         preserve;

        /**********************************************************************
                
                Construct this установи of заголовки, using a СтэкППГТ based
                upon a ':' delimiter   
              
        **********************************************************************/

        this (){
                super (':', да);
                строка = new Строки!(сим);
				}

        /**********************************************************************
                
                Clone a источник установи of ЗаголовкиППГТ

        **********************************************************************/

        this (ОбзорЗаголовковППГТ источник);

        /**********************************************************************
                
                Clone this установи of ОбзорЗаголовковППГТ

        **********************************************************************/

        ОбзорЗаголовковППГТ клонируй ();

        /***********************************************************************

                Control whether заголовки are duplicated or not. Default 
                behaviour is aliasing instead of copying, avoопрing any
                allocatation overhead. However, the default won't preserve
                those заголовки once добавьitional контент имеется been читай.

                To retain заголовки across arbitrary buffering, you should 
                установи this опция да

        ***********************************************************************/

        ОбзорЗаголовковППГТ retain (бул да = да);

        /**********************************************************************
                
                Чит все заголовок строки. Everything is mapped rather 
                than being allocated & copied

        **********************************************************************/

        override проц разбор (БуфВвод ввод);

        /**********************************************************************
                
                Return the значение of the provопрed заголовок, or пусто if the
                заголовок does not exist

        **********************************************************************/

        ткст получи (ИмяЗаголовкаППГТ имя, ткст def = пусто);

        /**********************************************************************
                
                Return the целое значение of the provопрed заголовок, or -1 
                if the заголовок does not exist

        **********************************************************************/

        цел получиЦел (ИмяЗаголовкаППГТ имя, цел def = -1);

        /**********************************************************************
                
                Return the дата значение of the provопрed заголовок, or Время.эпоха 
                if the заголовок does not exist

        **********************************************************************/

        Время дайДату (ИмяЗаголовкаППГТ имя, Время def = Время.эпоха);

        /**********************************************************************

                Iterate over the установи of заголовки. This is a shell around
                the superclass, where we can преобразуй the ТокенППГТ преобр_в 
                a ЭлементЗаголовка instead.

        **********************************************************************/

        цел opApply (цел delegate(ref ЭлементЗаголовка) дг);
        

        /**********************************************************************

                Созд a фильтр for iterating of a установи of named заголовки.
                We have в_ создай a фильтр since we can't пароль добавьitional
                аргументы directly в_ an opApply() метод.

        **********************************************************************/

        ФильтрованныеЗаголовки создайФильтр (ИмяЗаголовкаППГТ заголовок);

        /**********************************************************************

                Фильтр class for isolating a установи of named заголовки.

        **********************************************************************/

        private static class ФильтрованныеЗаголовки : ФильтрованныеТокены
        {       
                /**************************************************************

                        Construct a фильтр upon the specified заголовки, for
                        the given заголовок имя.

                **************************************************************/

                this (ОбзорЗаголовковППГТ заголовки, ИмяЗаголовкаППГТ заголовок);

                /**************************************************************

                        Iterate over все заголовки совпадают the given имя. 
                        This wraps the ТокенППГТ обходчик в_ преобразуй the 
                        вывод преобр_в a ЭлементЗаголовка instead.

                **************************************************************/

                цел opApply (цел delegate(ref ЭлементЗаголовка) дг);

        }
}


/******************************************************************************

        Maintains a установи of вывод заголовки. These are held in an вывод
        буфер, и indexed via a СтэкППГТ. Deleting a заголовок could be 
        supported by настройка the СтэкППГТ Запись в_ пусто, и ignoring
        such значения when it's время в_ пиши the заголовки.

******************************************************************************/

class ЗаголовкиППГТ : ОбзорЗаголовковППГТ
{
        /**********************************************************************
                
                Construct вывод заголовки

        **********************************************************************/

        this ();

        /**********************************************************************
                
                Clone a источник установи of ЗаголовкиППГТ

        **********************************************************************/

        this (ЗаголовкиППГТ источник);

        /**********************************************************************
                
                Clone this установи of ЗаголовкиППГТ

        **********************************************************************/

        ЗаголовкиППГТ клонируй ();

        /**********************************************************************
                
                Добавь the specified заголовок, и use a обрвызов в_ provопрe
                the контент.

        **********************************************************************/

        проц добавь (ИмяЗаголовкаППГТ имя, проц delegate(БуфВывод) дг);

        /**********************************************************************
                
                Добавь the specified заголовок и текст 

        **********************************************************************/

        проц добавь (ИмяЗаголовкаППГТ имя, ткст значение);

        /**********************************************************************
                
                Добавь the specified заголовок и целое значение

        **********************************************************************/

        проц добавьЦел (ИмяЗаголовкаППГТ имя, цел значение);

        /**********************************************************************
                
                Добавь the specified заголовок и дол/дата значение

        **********************************************************************/

        проц добавьДату (ИмяЗаголовкаППГТ имя, Время значение);

        /**********************************************************************
                
                Удали the specified заголовок заголовок. Returns нет if not 
                найдено.

        **********************************************************************/

        бул удали (ИмяЗаголовкаППГТ имя);
}
