module std.outbuffer;

private import stdrus;


alias stdrus.БуферВывода OutBuffer;
/+
extern(D) class БуферВывода
{
ббайт данные[];
бцел смещение;

invariant
    {
	assert(смещение <= данные.length);
	
    }
	
	this();	
	~this();
	
	ббайт[] вБайты();
	проц резервируй(бцел члобайт);
    проц пиши(ббайт[] байты);
    проц пиши(ббайт b);
    проц пиши(байт b);
    проц пиши(сим c);
    проц пиши(бкрат w);
    проц пиши(крат s);
    проц пиши(шим c);
    проц пиши(бцел w);
    проц пиши(цел i);
    проц пиши(бдол l);
    проц пиши(дол l);
    проц пиши(плав f);
    проц пиши(дво f);
    проц пиши(реал f);
    проц пиши(ткст s);
    проц пиши(БуферВывода буф);
    проц занули(бцел члобайт);
    проц расклад(бцел мера);
    проц расклад2();
    проц расклад4();
    ткст вТкст();
    проц ввыводф(ткст формат, спис_ва арги);
    проц выводф(ткст формат, ...);
    проц простели(бцел индекс, бцел члобайт);
}
+/